var y:real;           //
var start_ := -11.0;  //  В данной области
var end_ := 4.0;      //  задаются глобальные перменные
var step_ := 0.1;     //

////////////////////////////////////////////////////////////////////////////////

function task1(num:integer):real;
begin
  var x:=num;
  
  if x < -9 then result:= Exp(x) * log10(x) - 8                               // Здесь решение задания №1. 
  else if x < -4 then result:= 99 + Exp(x)                                    // В завимости от значения передаваемого аргумента в функцию 
  else if (-4 <= x)  and (x < 2) then result:= Power(x, 0.1*x) + cos(2*x)     // она смотрит через дерево сравнений из какого диапазона заданное число
  else if 2 <= x then result:= Exp(x) - Power(x, 0.1*x)                       // и в зависимости от попадаемого диапазона возращает значение типа real
  else result:= 0                                                             // 
end;


//////////////////////////////////////////////////////////////////////////////// В области ниже объявляются вспомогательные процедуры.
//////////////////////////////////////////////////////////////////////////////// Это задание №2 с прогоном по диапазону [-11;4] с шагом 0.1

procedure sup_proc_1;
begin
  writeln('| ','X  ':5,' | ','Y  ':5,' |');
  while  start_ <= - 9 do
    begin
      y:= Exp(start_) * log10(start_) - 8;
      writeln ('| ', start_:5:1 ,' | ', y:5:1 ,' |');                         // На эти строки можно не обращать внимания, они нужны для красивого вывода
      start_:= start_ + step_;                                                // start_:5:1 } здесь 5 это ширина строки, 1 это кол-во знаков после запятой
    end;
end;



procedure sup_proc_2;
begin
  writeln('| ','X  ':5,' | ','Y  ':5,' |');
  while  start_ <= - 4 do
    begin
      y:= 99 + Exp(start_);
      writeln ('| ', start_:5:1 ,' | ', y:5:1 ,' |');
      start_:= start_ + step_;
    end; 
end;



procedure sup_proc_3;
begin
  writeln('| ','X  ':5,' | ','Y  ':5,' |');
  while  start_ <= 2 do
    begin
      y:=Power(start_, 0.1 * start_) + cos(2 * start_);
      writeln ('| ', start_:5:1 ,' | ', y:5:1 ,' |');
      start_:= start_ + step_;
    end; 
end; 



procedure sup_proc_4;
begin
  writeln('| ','X  ':5,' | ','Y  ':5,' |');
  while start_ <= 4.0 do
    begin
      y:= Exp(start_) - Power(start_, 0.1 * start_);
      writeln ('| ', start_:5:1 ,' | ', y:5:1 ,' |');
      start_:= start_ + step_;
    end;
end;



//////////////////////////////////////////////////////////////////////////////// В области ниже мы вызываем одну из объявленных выше процедур.
//////////////////////////////////////////////////////////////////////////////// В зависимости, какая нам нужна.

procedure task2(num_of_func:integer);
begin
  var num:= num_of_func;
  
  case num of 
    1:sup_proc_1;
    2:sup_proc_2;
    3:sup_proc_3;
    4:sup_proc_4; 
  end;
end;  

////////////////////////////////////////////////////////////////////////////////  

Begin
  writeln(task1(1)); // <-- в функцию передавать число типа integer!             Тут мы выводим то , что нам вернула функция из задания №1.
  task2(1) // <-- в процедуру подавать число типа integer!                       Тут мы вызываем нужную нам процедуру, которая уже будет прогнана по диапазону.
End.